---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidElevationSketch
source: html/aea2151e-6dd9-539a-2e46-0c5e10f8f5f0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidElevationSketch Property

Elevation Profile sketch is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidElevationSketch { get; }
```